{
  "hola": "¡Hola! Soy BotAgroEco. ¿En qué puedo ayudarte Amigo?",
  "adios": "¡Hasta luego! 🌱",
  "gracias": "¡De nada! Estoy aquí para ayudarte.",
  "como sembrar maiz": "Haz surcos en la tierra, coloca las semillas a 3 cm de profundidad y riega moderadamente.",
  "cuando sembrar tomates": "Los tomates se siembran en primavera o cuando no haya riesgo de heladas.",
  "cuanta agua necesita la lechuga": "La lechuga necesita riego frecuente, manteniendo el suelo húmedo pero no encharcado.",
  "como fertilizar la tierra naturalmente": "Puedes usar compost, estiércol o humus de lombriz como fertilizantes naturales.",
  "cuanto sol necesita el jitomate": "El jitomate necesita al menos 6 horas de sol directo al día.",
  "como controlar plagas en tomates": "Usa trampas con feromonas o insecticidas orgánicos como el neem.",
  "como eliminar pulgones naturalmente": "Usa agua con jabón o introduce mariquitas en el cultivo.",
  "que plaga ataca al tomate": "El tomate puede ser atacado por gusanos, pulgones y la mosca blanca.",
  "como prevenir hongos en plantas": "Evita el exceso de riego y mejora la ventilación entre plantas.",
  "cuando debo cosechar papas": "Las papas se cosechan cuando las plantas comienzan a secarse, entre 90 y 120 días.",
  "como cosechar zanahorias": "Afloja la tierra alrededor y tira suavemente de la planta para extraerla.",
  "como sembrar lechuga en maceta": "Usa una maceta con buen drenaje y tierra húmeda, siembra las semillas superficialmente.",
  "puedo sembrar zanahorias en casa": "Sí, las zanahorias crecen bien en macetas profundas con buen drenaje.",
  "cuando fertilizar plantas": "Es ideal hacerlo durante la fase de crecimiento y floración, cada 15 días si es orgánico.",
  "como eliminar caracoles en el huerto": "Coloca trampas con cerveza o cáscaras de huevo alrededor de las plantas.",
  "puedo usar cafe en las plantas": "Sí, los restos de café sirven como abono y alejan algunas plagas.",
  "cuando es mejor regar las plantas": "Por la mañana temprano o al atardecer, para evitar la evaporación.",
  "que hacer si hay heladas": "Cubre tus plantas con plásticos o mantas térmicas durante la noche.",
  "puedo sembrar en macetas": "¡Claro! Solo asegúrate de que tengan buen drenaje y suficiente espacio para las raíces.",
  "que puedo sembrar en clima seco": "En clima seco puedes sembrar sorgo, nopal o agave.",
  "como hacer compost casero": "Usa restos de comida, hojas secas y evita carnes o aceites. Mezcla y deja descomponer.",
  "que hacer si mi planta se pone amarilla": "Revisa el riego, la luz y posibles plagas. Puede ser exceso de agua o falta de nutrientes.",
  "cuanto crece una planta de tomate": "Puede alcanzar entre 1 y 2 metros dependiendo de la variedad y cuidados.",
  "como cuidar una planta de chile": "Requiere sol, riego moderado y poda de hojas secas o dañadas.",
  "como alejar mosquitos del jardín": "Planta citronela, albahaca o lavanda. También sirve agua con vinagre en recipientes.",
  "cuanto tarda en crecer el maiz": "El maíz tarda entre 90 y 120 días desde la siembra hasta la cosecha.",
  "como evitar enfermedades en plantas": "Usa semillas sanas, evita el exceso de humedad y desinfecta herramientas.",
  "que hacer si hay muchas hormigas": "Espolvorea canela o café molido alrededor de las plantas. No uses químicos fuertes.",
  "como identificar si falta riego": "Si las hojas se ven caídas o el suelo está muy seco, probablemente necesiten agua.",
  "puedo usar agua de arroz para plantas": "Sí, aporta nutrientes como fósforo y potasio. Úsala sin sal ni aceite.",
  "como regar una planta en maceta": "Riega hasta que el agua salga por los orificios de drenaje. No dejes encharcado.",
  "como sembrar calabaza": "Haz hoyos de 2 cm, siembra 2 o 3 semillas, riega y mantén al sol.",
  "que nutrientes necesita la tierra": "Nitrógeno, fósforo y potasio son los principales. Puedes complementarlos con compost.",
  "puedo usar cascarones de huevo": "Sí, tritúralos y agrégalos al sustrato para aportar calcio.",
  "que plantas crecen rapido": "Rábanos, lechugas, espinacas y acelgas son de crecimiento rápido.",
  "que hacer si hay muchas moscas": "Evita dejar fruta podrida y usa trampas con vinagre y jabón.",
  "que flores atraen abejas": "Lavanda, girasol, albahaca, menta y caléndula son ideales.",
  "que puedo sembrar en verano": "En verano puedes sembrar jitomate, chile, berenjena y maíz.",
  "que puedo sembrar en otoño": "En otoño siembra espinacas, zanahorias, rábanos y lechuga.",
  "que puedo sembrar en invierno": "Puedes sembrar ajo, cebolla y algunas legumbres como habas.",
  "como usar el neem": "Mezcla el extracto con agua y jabón potásico, rocía en las hojas por la tarde.",
  "como saber si ya cosechar": "Observa el tamaño, el color y el tiempo desde la siembra. Consulta por cultivo específico.",
  "que puedo hacer con plantas secas": "Puedes compostarlas si no tienen plagas o usarlas como acolchado.",
  "cuanto tiempo vive una planta de tomate": "Entre 6 y 8 meses si se mantiene sana y con buen cuidado.",
  "como proteger las plantas del sol fuerte": "Usa mallas sombra o muévelas a un lugar con sombra parcial.",
  "como estimular el crecimiento de las plantas": "Aplica fertilizantes orgánicos y asegúrate de tener buena luz y agua.",
  "frase motivadora agricola": "Cada semilla es una promesa de esperanza. ¡Sigue cultivando!"
}
